Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །ཁྱོད་ནི་འབྱུང་པོ་རྣམས་ཀྱིས་བསྙེངས་པར་མ་གྱུར་སྐུ་ཡང་གཡོ་བ་མི་མངའ་སྟེ།
en: But the spirits did not frighten you, nor could they move your body;

source: །ཁུར་ལྕི་ཕྱག་གིས་བརྡབས་ནས་ཀུན་ཏུ་གཡོས་ཏེ་བདུད་ཀྱི་སྡེ་ལས་རྒྱལ་བར་གྱུར།
en: Rather your hand struck hard, shaking them, and you defeated Māra’s army.

source: །ཇི་ལྟར་སྔ་མ་རྣམས་ཀྱིས་སེང་གེའི་ཁྲི་ལ་བྱང་ཆུབ་དམ་པ་བརྙེས་གྱུར་པ།
en: “Just as the previous ones attained sublime awakening on the lion throne, You have followed in their footsteps;

source: །དེ་ལྟར་ཁྱོད་ཀྱིས་རྗེས་སུ་སངས་རྒྱས་མཚུངས་ཤིང་མཉམ་སྟེ་གཞན་དུ་གྱུར་མ་ལགས།
en: you awakened and became the same as them.

source: །ཡིད་ཀྱང་མཉམ་ཞིང་སེམས་ཀྱང་མཉམ་སྟེ་ཁྱོད་བདག་ཉིད་ཀྱིས་ཐམས་ཅད་མཁྱེན་ཉིད་བརྙེས།
en: Identical in heart and mind, you have attained omniscience.

source: །དེས་ན་ཁྱོད་ནི་འཇིག་རྟེན་དམ་པ་རང་བྱུང་འགྲོ་བ་རྣམས་ཀྱི་བསོད་ནམས་ཞིང་།
en: Thus, Sublime Being in the World, Self-Arisen One, you are a field of merit for beings.”

source: །དགེ་སློང་དག་དེ་ལྟར་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Monks, once Śakra, lord of the gods, together with the gods from the Heaven of the Thirty-Three, had praised the Thus-Gone One, with palms joined they bowed to the Thus-Gone One and sat to one side.

source: །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། མེ་ཏོག་ཨ་ཏི་མུག་ཏ་ཀ་དང་། ཙམ་པ་ཀ་དང་། སྣ་མའི་མེ་ཏོག་དང་། བར་ཤི་ཀ་དང་། དྷ་ནུས་ཀ་རིའི་ཕྲེང་བ་དང་། ཆུན་པོ་ཐོགས་ཏེ།
en: Next the Four Great Kings, together with the gods from the Heaven of the Four Great Kings, went to the place where the Thus-Gone One was. When they arrived, they paid homage to him. Hundreds of thousands of gods surrounded him, holding garlands and bouquets of abhimuktaka flowers, campaka flowers, jasmine flowers, nutmeg blossoms, and dhānuṣkāri flowers.

source: ལྷའི་བུ་མོ་བརྒྱ་སྟོང་གིས་བསྐོར་ནས་ལྷའི་གླུ་དབྱངས་ལེན་པས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱས་ཏེ། ཚུལ་དང་འཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: Hundreds of thousands of celestial maidens surrounded him, singing divine songs. Thereafter they all praised the Thus-Gone One with these fitting verses:

source: །ཤིན་ཏུ་གསུང་སྙན་དབྱངས་ནི་ཡིད་དུ་མཆི།
en: “You whose speech is exceedingly melodious and whose cadence is captivating,

source: །ཟླ་ལྟར་རབ་ཏུ་ཞི་མཛད་ཐུགས་དང་བ།
en: Who is soothing and clear minded like the moon,

source: །འཛུམ་པའི་ཞལ་ལྡན་ལྗགས་ནི་རབ་ཡངས་པ།
en: Whose face is smiling and whose tongue is long,

source: །ཐུབ་མཆོག་དགའ་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: To you, Supreme Enrapturing Sage, we pay homage!

source: །ལྷ་མི་རྣམས་ཀྱི་སྙན་ཅིང་དགར་འགྱུར་བ། །སྒྲ་སྐད་གང་དག་འཇིག་རྟེན་མཆིས་པ་ཀུན། །ཁྱོད་ཀྱི་འཇམ་པའི་གསུང་ནི་ཕྱུང་བས་ན།
en: “When your melodious speech, A voice so sweet and beloved among gods and humans, Resounds throughout all the worlds,

source: །མི་ཡི་སྒྲ་སྐད་ཐམས་ཅད་ཟིལ་གྱིས་ནོན།
en: It surpasses the voice of all who can speak!

source: །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་ཉོན་མོངས་ཞི།
en: “It quells the afflictions of attachment, anger, and delusion;

source: །མི་མིན་དགའ་བ་རྣམ་པར་དག་པ་སྐྱེད།
en: It engenders pristine joy within nonhumans.

source: །རྙོག་པ་མ་མཆིས་སྙིང་གིས་ཆོས་ཐོས་ནས།
en: Upon hearing the Dharma with a stainless heart,

source: །དེ་ཀུན་འཕགས་པའི་རྣམ་པར་གྲོལ་བ་ཐོབ།
en: They all attain exalted liberation.

source: །ཁྱོད་ནི་མི་མཁས་རྣམས་ལ་བརྙས་མི་མཛད།
en: “You do not disparage the ignorant,

source: །མཁས་པའི་རྒྱགས་པས་ནམས་ཀྱང་རྒྱགས་མ་གྱུར།
en: Nor are you ever drunk with conceit about your knowledge.

source: །ཁྱོད་ནི་འགྱིང་བ་མི་མངའ་ཞུམ་མི་མངའ།
en: You are neither pompous nor timid,

source: །རྒྱ་མཚོའི་དབུས་ནས་རི་མཆོག་འཕགས་པ་བཞིན།
en: Like a firm mountain in the middle of a sea.

source: །དེ་འདྲའི་སེམས་ཅན་འཇིག་རྟེན་བྱུང་བས་ན། །མི་རྣམས་འདིར་ནི་རྙེད་པ་ལེགས་པར་རྙེད།
en: “People here have profited well Since such a being has appeared in the world!

source: །པད་མ་དཔལ་ལྟར་ནོར་རྣམས་སྦྱིན་པ་པོ།
en: Like the goddess of wealth who is the giver of riches,

source: །དེ་ལྟར་འཇིག་རྟེན་ཀུན་ལ་མཆོད་སྦྱིན་མཛད།
en: You will bestow your Dharma throughout the whole world!”

source: །དེ་ལྟར་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་སོགས་པ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Once the gods of the Heaven of the Four Great Kings, led foremost by the Four Great Kings themselves, had praised the Thus-Gone One in repose at the seat of awakening, they joined palms and bowed to the Thus-Gone One and stood to one side.

source: །དེ་ནས་བར་སྣང་གི་ལྷ་རྣམས་དེ་བཞིན་གཤེགས་པའི་དྲུང་དུ་ལྷགས་ཏེ།
en: Then the gods of the sky approached the Thus-Gone One.

source: མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་བར་སྣང་ཐམས་ཅད་རིན་པོ་ཆེའི་དྲ་བ་དང་། དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་དང་། རིན་པོ་ཆེའི་གདུགས་རྣམས་དང་། རིན་པོ་ཆེའི་བ་དན་རྣམས་དང་། རིན་པོ་ཆེ་དང་དར་གྱི་ལྡ་ལྡི་དང་། རིན་པོ་ཆེའི་མེ་ཏོག་རྣ་རྒྱན་དང་། མུ་ཏིག་གི་ཆུན་ཁོར་དང་། མེ་ཏོག་གི་ལྡ་ལྡི་སྣ་ཚོགས་རྣམས་ལུས་ཕྱེད་ཕྱུང་བའི་ལྷ་རྣམས་ཀྱིས་བཟུང་བ་དང་། ཟླ་གམ་རྣམས་ཀྱིས་ལེགས་པར་བརྒྱན་ནས་དེ་བཞིན་གཤེགས་པ་ལ་ཕུལ་ལོ།
en: As a way of paying homage to the Perfect and Completely Awakened One, the gods adorned the whole sky with a net of jewels and small bells. They offered him jewel parasols, jewel banners, jewel and silk brocade wreaths, ornate jewel earrings, flower wreaths, and pearl strands of various types held by gods who revealed the upper half of their bodies, as well as crescent moons.

source: །ཕུལ་ནས་ཀྱང་སྤྱན་སྔ་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: Upon making these offerings, in his presence they praised him with these verses:

source: །ཐུབ་པ་མཁས་ལ་བདག་ཅག་མཆིས་ནས་ནི།
en: “Dwelling constantly in the sky, O Sage,

source: །འགྲོ་བའི་སྤྱོད་ཀུན་ཇི་བཞིན་གསལ་བལྟས་ཤིང་།
en: We clearly see all the activities of beings as they are.

source: །སེམས་ཅན་དག་པ་ཁྱོད་ཀྱི་སྤྱོད་བལྟས་ན།
en: Looking at your conduct, O Pristine Sentient Being,

source: །དེ་ལྟར་ཁྱོད་ཀྱི་ཐུགས་གཅིག་འཁྲུལ་མ་མཐོང་།
en: We do not see confusion in your focused mind.

source: །མཆོད་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་གང་ལྷགས་པ། །མི་ཡི་འདྲེན་པ་དེ་དག་ནམ་མཁའ་ཁྱབ།
en: “The sky is filled with the guides of humans, Bodhisattvas who have come to pay tribute.

source: །འདི་ལྟར་དེ་དག་ནམ་མཁའི་ལུས་ལགས་པས།
en: Since in this way they are bodies of space,

source: །གཞལ་མེད་ཁང་རྣམས་ལ་ཡང་གནོད་མ་མཆིས།
en: No harm is caused to the celestial mansions.

source: །བར་སྣང་ནས་ནི་མེ་ཏོག་ཆར་བབ་པ།
en: “Even though rains of flowers,

source: །སྟོང་ཆེན་བྱུར་བུར་རབ་ཏུ་གང་གྱུར་པ།
en: Enough to fill a world system to the brim,

source: །དེ་དག་མ་ལུས་ཁྱོད་ཀྱི་སྐུར་བབ་ཀྱང་།
en: Descend onto your body from the sky,

source: །འབབ་ཆུ་རྒྱ་མཚོར་བབ་པ་བཞིན་དུ་གྱུར།
en: They are like rivers flowing into an ocean.

source: །གདུགས་དང་མེ་ཏོག་རྣ་རྒྱན་མེ་ཏོག་ཕྲེང་།
en: “We see parasols, flowers, earrings, and garlands,

source: །མེ་ཏོག་ཙམ་པ་ཀ་ཡི་ལྡ་ལྡི་དང་། །རྒྱན་ཕྲེང་ཟླ་བ་ཟླ་གམ་རྣམས་ཀྱང་འཐོར།
en: Wreaths of campaka flowers, Necklaces, moons, and crescent moons.

source: །ལྷ་ཡིས་གཏོར་ཀྱང་འདྲེས་པར་གྱུར་མ་མཆིས།
en: The gods bestrew you with them, yet they are not mixed together.

source: །བར་སྣང་ཐམས་ཅད་ལྷ་ཡིས་གང་གྱུར་ཏེ། །འདི་ལ་སྐྲ་ཙམ་གཞག་པའི་གནས་མ་མཆིས།
en: “There is no room here for even a hair—The whole sky is filled with gods.

source: །རྐང་གཉིས་མཆོག་ལ་མཆོད་པ་བགྱིད་ཀྱང་ནི།
en: They pay homage to you, Supreme Biped,

source: །ཁྱོད་ལ་རྒྱགས་པའམ་ངོ་མཚར་འགྱུར་མི་མངའ།
en: But you are neither proud nor overwhelmed.”

source: །དེ་ལྟར་བར་སྣང་གི་ལྷ་རྣམས་ཀྱིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Once the gods of the sky had so praised the Thus-Gone One in repose at the seat of awakening, they joined palms and bowed to him and stood to one side.

source: །དེ་ནས་ས་བླའི་ལྷ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ས་གཞི་ཐམས་ཅད་ལེགས་པར་ཕྱགས་ཏེ་བྱུགས་ནས་སྤོས་ཆུས་ཆག་ཆག་བཏབ་སྟེ། མེ་ཏོག་གིས་ཆལ་བར་བཀང་ནས་རས་བཅོས་བུ་སྣ་ཚོགས་ཀྱི་བླ་རེ་བྲེས་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ཕུལ་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །
en: Then the terrestrial gods, in order to pay homage to the Thus-Gone One, cleansed and anointed the entire surface of the earth, sprinkled it with perfumed water, strewed it with flowers, covered it with canopies of various dyed fabrics, and then offered it to the Thus-Gone One. Thereafter they praised him with these verses:

source: སྟོང་གསུམ་རྡོ་རྗེ་ལྟ་བུར་མི་ཤིགས་གནས་པར་གྱུར། །ང་འདིར་པགས་པ་ཤ་དང་རུས་པ་རྐང་སྐམས་ཀྱང་། །བྱང་ཆུབ་མ་རེག་ང་ནི་འདི་ནས་མི་ལྡང་ཞེས། །རྡོ་རྗེའི་གནས་ཀྱིས་དེ་ནི་བྱང་ཆུབ་སྙིང་པོར་བཞུགས།
en: “The trichiliocosm has become as indestructible and firm as a vajra. You sat on the seat of awakening by virtue of your vajra-hard position when you said:

source: །གལ་ཏེ་མི་ཡི་སེང་གེ་ཁྱོད་ཀྱིས་སྟོང་གསུམ་ཀུན། །བྱིན་གྱིས་མ་བརླབས་ན་ནི་གང་དག་རྐང་མཐིལ་གྱིས། །བྱེ་བའི་ཞིང་རྣམས་བསྐྱོད་པ་དེ་ལྟར་ཤུགས་ཆེ་བ། །བྱང་ཆུབ་སེམས་དཔའ་ལྷགས་ཚེ་མ་ལུས་ཞིག་པར་འགྱུར། །ས་ཕྱོགས་གང་དུ་སེམས་ཅན་དམ་པ་འཆག་པ་ནི།
en: ‘Even should my skin, flesh, bones, and marrow shrivel up right here, I will not rise from this place without reaching awakening.’ “If you, Lion among Men, do not consecrate the entire trichiliocosm, Then the whole thing will collapse With the violent shock of the arrival of bodhisattvas, The soles of whose feet will cause ten million realms to quake.

source: །ས་ཡི་ལྷ་ཡིས་རྙེད་པ་རྒྱ་ཆེན་ལེགས་པར་རྙེད།
en: “An illustrious gift is gained by the terrestrial gods Wherever the most sublime being happens to walk.

source: །འཇིག་རྟེན་རྡུལ་རྣམས་ཇི་སྙེད་ཁྱོད་ཀྱིས་སྣང་བར་མཛད།
en: You illuminate darkness everywhere in the world;

source: །སྟོང་གསུམ་མཆོད་རྟེན་གྱུར་ན་ཁྱོད་སྐུ་སྨོས་ཅི་འཚལ།
en: Now that the trichiliocosm is a basis for worship, how much more so is your body?

source: །འོག་གི་ཆུ་ཡི་ཕུང་པོ་བརྒྱ་སྟོང་ཇི་སྙེད་དང་། །ས་ཡི་སྟེང་ན་འགྲོ་བའི་འཚོ་བ་ཇི་སྙེད་པ། །སྟོང་གསུམ་ས་རྣམས་ཐམས་ཅད་བདག་ཅག་གཟུང་བར་བགྱི།
en: “Should we take hold of all the lands of the trichiliocosm— All the myriad hundreds of thousands of subterranean bodies of water, And all the myriad livelihoods of beings in those places—

source: །ཁྱོད་ལ་ཀུན་འབུལ་ཇི་ལྟར་བཞེད་བཞིན་སྤྱད་དུ་གསོལ།
en: We would offer it all to you. May you use it according to your wishes!

source: །གང་དུ་ཁྱོད་ནི་བཞུགས་སམ་འཆག་གམ་མནལ་བ་དང་། །གཽ་ཏམ་བདེ་བར་གཤེགས་པའི་སྲས་པོ་ཉན་ཐོས་གང་།
en: “Wherever you shall sit, travel, or rest, And wherever the hearers, who are the children of the Well-Gone Gautama,

source: །ཆོས་གཏམ་སྨྲ་དང་གང་ཡང་དེ་དག་མཉན་པ་དང་། །དགེ་བའི་རྩ་བ་ཐམས་ཅད་བྱང་ཆུབ་ཕྱིར་བསྔོའོ།
en: Shall preach or listen to the Dharma, We dedicate all the roots of virtue for the sake of awakening!”

source: །དེ་ལྟར་ས་བླའི་ལྷ་རྣམས་ཀྱིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Once the terrestrial gods had praised in this manner the Thus-Gone One sitting in repose at the seat of awakening, they bowed to him with palms joined and stood to one side.

source: །མངོན་པར་བསྟོད་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་ཉི་ཤུ་རྩ་གསུམ་པའོ།། །།
en: This concludes the twenty-third chapter, on exaltation.

source: དགེ་སློང་དག་དེ་ལྟར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་དེ་བཞིན་གཤེགས་པ་ལྷ་རྣམས་ཀྱིས་བསྟོད་ཅིང་སྐྱིལ་མོ་ཀྲུང་མ་བཤིག །སྤྱན་མི་འཛུམས་པར་ཤིང་གི་རྒྱལ་པོ་ལ་གཟིགས་ཤིང་བསམ་གཏན་དང་དགའ་བའི་ཟས་ཀྱི་བདེ་བ་མྱོང་བར་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་ཞག་བདུན་འདས་པར་གྱུར་ཏོ།
en: Monks, while the Thus-Gone One was being praised by the gods after he had reached perfect and complete awakening, he stared at the king of trees without blinking and without getting out of his cross-legged position. Seven days passed in this way while he was at the foot of the Bodhi tree experiencing bliss from the sustenance of concentration and joy.

source: །དེ་ནས་ཞག་བདུན་འདས་པ་དང་། འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་སྤོས་ཆུའི་བུམ་པ་ཁྲི་ཐོགས་ཏེ།
en: Then, once the seven days had passed, the gods from the desire realm approached the Thus-Gone One, carrying tens of thousands of vases containing scented water.

source: དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེར་ལྷགས་སོ། །གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་ཀྱང་སྤོས་ཆུའི་བུམ་པ་ཁྲི་ཐོགས་ཏེ།
en: The gods from the form realm also approached the Thus-Gone One, carrying tens of thousands of vases containing scented water.

source: །དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས། བྱང་ཆུབ་ཀྱི་ཤིང་དང་། དེ་བཞིན་གཤེགས་པ་ལ་སྤོས་ཆུས་བཀྲུས་སོ།
en: When they arrived, they bathed the Bodhi tree and the Thus-Gone One with the scented water.

source: །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་བགྲང་བ་ལས་འདས་པ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ཕོག་པའི་སྤོས་ཆུ་དེས་རང་རང་གི་ལུས་ལ་བསྐུས་སོ།
en: Innumerable gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kinnaras, and mahoragas anointed their own bodies with the scented water that had come into contact with the body of the Thus-Gone One.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་སེམས་བསྐྱེད་དོ།
en: This engendered among them the intention set on unexcelled, perfect, and complete awakening.

source: །ལྷའི་བུ་ལ་སོགས་པ་དེ་དག་རང་རང་གི་གནས་སུ་ཕྱིན་ཀྱང་སྤོས་ཆུ་དེ་དང་མ་བྲལ་བར་གྱུར་ཏེ། སྤོས་གཞན་ལ་འདོད་པ་མི་སྐྱེད་དོ།
en: Even after the gods and the others had returned to their respective realms, they did not part from the scented water and desired no other scent.

source: །དེ་དག་དེ་བཞིན་གཤེགས་པ་ལ་གུས་པར་ཡིད་ལ་བྱ་བ་ལས་སྐྱེས་པའི་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: Through the joy and the supreme joy that are born from respectfully taking to heart the Thus-Gone One, they became irreversible from unexcelled, perfect, and complete awakening.

source: །དགེ་སློང་དག་དེ་ནས་ལྷའི་བུ་ཀུན་ནས་མེ་ཏོག་ཅེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་པ་དེས་དེ་བཞིན་གཤེགས་པའི་ཞབས་གཉིས་ལ་གཏུགས་ཏེ། ཐལ་མོ་སྦྱར་ནས་དེ་བཞིན་གཤེགས་པ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་གང་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་ལ་དགུང་བདུན་དུ་སྐྱིལ་མོ་ཀྲུང་མ་བཤིག་པར་བཞུགས་པའི་ཏིང་ངེ་འཛིན་དེའི་མིང་ཅི་ཞེས་བགྱི།
en: Monks, then a god named Samantakusuma, who had joined in that very audience, bowed down to the feet of the Thus-Gone One, and with palms joined said to him, “What, O Blessed One, is the name of the absorption in which the Thus-Gone One remained for seven days without moving from the cross-legged position?”

source: དགེ་སློང་དག་དེ་སྐད་ཅེས་གསོལ་པ་དང་། དེ་བཞིན་གཤེགས་པ་དེས་ལྷའི་བུ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ལྷའི་བུ་ཏིང་ངེ་འཛིན་འདིའི་མིང་ནི་དགའ་བའི་ཟས་བཀོད་པ་ཞེས་བྱ་སྟེ། ཏིང་ངེ་འཛིན་འདི་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་ཞག་བདུན་དུ་སྐྱིལ་མོ་ཀྲུང་མ་བཤིག་པར་བཞུགས་སོ།
en: Monks, thus addressed, the Thus-Gone One answered the god, “Array of the food of joy, O divine son, is the name of the meditative absorption in which the Thus-Gone One remained for seven days without moving from the cross-legged position.”

source: །དགེ་སློང་དག་དེ་ནས་ལྷའི་བུ་ཀུན་ནས་མེ་ཏོག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: Monks, the god Samantakusuma then praised the Thus-Gone One with these verses:

source: །ཞབས་ནི་འཁོར་ལོས་ཁྱབ་པ་པོ།
en: “Your feet are covered with wheels

source: །པད་འདབ་རྡུལ་མེད་སྟོང་གཟི་ལྡན།
en: And shine with the brilliance of stainless, thousand-petaled lotuses.

source: །ལྷ་ཡི་ཅོད་པན་ཞབས་གཏུགས་པ།
en: The crowns of gods brush your feet;

source: །དཔལ་སྟུག་ཞབས་ལ་ཕྱག་འཚལ་ལོ།
en: To your feet, replete with splendor, I bow down!”

source: །བདེ་གཤེགས་ཞབས་ལ་ཕྱག་འཚལ་ནས།
en: When he bowed to the feet of the Well-Gone One,

source: །དེ་ཚེ་ལྷ་བུ་དེ་སེམས་དགའ།
en: The god became delighted.

source: །ལྷ་མིན་རབ་ཏུ་ཞི་བྱེད་པ།
en: He said this, which was soothing to gods and humans,

source: །ཡིད་གཉིས་སེལ་བའི་ཚིག་འདི་སྨྲས།
en: And removed their doubt:

source: །ཤཱཀྱའི་རིགས་ལ་དགྱེས་སྐྱེད་པ།
en: “You give joy to the Śākya clan;

source: །ཆགས་སྡང་གཏི་མུག་མཐར་འབྱིན་པ།
en: You bring an end to attachment, anger, and delusion.

source: །ཞུས་པ་རྣམས་ཀྱང་མཐར་འབྱིན་པ།
en: You bring the culmination of all wishes;

source: །ལྷ་མིའི་དོགས་པ་བསལ་དུ་གསོལ།
en: Please dispel the doubts of gods and humans.

source: །དཔག་མེད་ཐམས་ཅད་མཁྱེན་པ་ཉིད།
en: “You have gained immeasurable omniscience,

source: །སངས་རྒྱས་སྟོབས་བཅུ་ཅི་སླད་དུ།
en: A buddha with the ten powers.

source: །རྒྱལ་བ་དོག་སའི་སྙིང་པོར་ནི།
en: So, Victorious One, why do you remain at the center of the earth

source: །དགུང་བདུན་སྐྱིལ་མོ་ཀྲུང་མ་བཤིག །འདབ་བརྒྱ་རྒྱས་པའི་སྤྱན་མངའ་བ། །ཅི་ཞིག་གཟིགས་ན་དགུང་བདུན་དུ།
en: In the cross-legged pose for seven days? “What are you staring at for seven days, With your eyes that are like blooming hundred-petaled lotuses

source: །མི་ཡི་སེང་གེ་རྣམ་དག་སྤྱན།
en: As you gaze, O Lion among Men,

source: །སྤྱན་མི་འཛུམས་པར་གཟིགས་པ་མཛད།
en: With your unblinking and pristine eyes? “Is it your aspiration That makes you remain cross-legged

source: །གང་གིས་ཤིང་རྒྱལ་དྲུང་དུ་ནི། །སྐྱིལ་ཀྲུང་མ་བཤིག་དགུང་བདུན་བཞུགས། །སྨོན་ལམ་འདི་ནི་ཁྱོད་ཀྱི་འམ།
en: For seven days at the king of trees?

source: །སྨྲ་བའི་སེང་གེ་ཀུན་གྱི་ལགས།
en: Or is it common to all the lions of speech?

source: །ཚེམས་ནི་མཉམ་ཞིང་རྣམ་དག་པ།
en: “With teeth so even and pure,

source: །སྟོབས་བཅུའི་ཞལ་ནི་དྲི་རབ་གདའ།
en: And with the supremely fragrant breath of one with the ten powers,

source: །མ་ནོར་ལེགས་པར་བཀའ་སྩོལ་ཏེ།
en: Please speak words of unadulterated truth,

source: །ལྷ་དང་མི་རྣམས་དགའ་བར་མཛོད།
en: And thus bring joy to gods and humans!”

source: །ཟླ་འདྲའི་ཞལ་གྱིས་བཀའ་སྩལ་པ།
en: The Moon-Faced One replied:

source: །ངས་བཤད་ལྷ་ཡི་བུ་ཉོན་ཅིག །ངས་ནི་དྲིས་པ་དེ་ཡི་ལན། །ཅུང་ཟད་ཙམ་ཞིག་བཤད་པར་བྱ།
en: “Listen, divine son, to what I say! I will briefly offer A response to these questions.

source: །དཔེར་ན་རྒྱལ་པོ་ཕྱོགས་གང་དུ།
en: “Just as a king does not leave the place

source: །གཉེན་གྱི་ཚོགས་ཀྱིས་དབང་བསྐུར་བ།
en: Where he was consecrated by his kinfolk

source: །ཞག་བདུན་བར་དུ་ས་ཕྱོགས་དེ།
en: For a duration of seven days,

source: །མི་འདོར་རྒྱལ་པོའི་ཆོས་ཉིད་དོ།
en: Since that is the duty of kings,

source: །དེ་བཞིན་སྟོབས་བཅུ་མངའ་བ་ཡང་།
en: “So also victorious ones, even with the ten powers,

source: །གང་ཚེ་སྨོན་རྫོགས་དབང་བསྐུར་བ། །ས་ཡི་སྙིང་པོར་ཞག་བདུན་དུ། །རྒྱལ་བ་སྐྱིལ་མོ་ཀྲུང་མི་འཇིག །
en: When consecrated, their aspirations fulfilled, Remain in the cross-legged position At the center of the earth for seven days.

source: དཔེར་ན་དཔའ་བོ་དགྲ་ཚོགས་རྣམས། །མ་ལུས་ཕམ་བྱས་ལྟ་བ་ལྟར།
en: “Just as a warrior stares At vanquished enemy troops,

source: །བྱང་ཆུབ་སྙིང་པོར་སངས་རྒྱས་ཀྱང་།
en: Buddhas too, at the seat of awakening,

source: །ཉོན་མོངས་བཅོམ་ནས་གཟིགས་པ་མཛད།
en: Stare at the afflictions, now destroyed.

source: །གཏི་མུག་བྱུང་བའི་འདོད་དང་ཁྲོ།
en: “Attachment and anger, born from delusion,

source: །དེ་དག་འགྲོ་བའི་དགྲ་འདྲ་སྟེ།
en: Are like the foes of beings.

source: །ཆོམ་པོ་ཆས་ནི་བཟང་འདྲ་བ།
en: Like thieves with their stolen goods,

source: །དེ་དག་མ་ལུས་ངས་འདིར་བཤིག །ངས་འདིར་ང་རྒྱལ་རྣམ་དགུ་དང་། །གནས་མེད་རློམ་སེམས་རབ་ཏུ་བཅོམ།
en: I have destroyed them here. “Here I destroyed manifold forms of pride And arrogance too, so that they exist no more.

source: །ཟག་པ་ཐམས་ཅད་རབ་ཏུ་སྤངས།
en: I relinquished all defilements,

source: །ང་ཡི་ཡེ་ཤེས་དམ་པ་སྐྱེས།
en: And the highest wisdom has dawned in me.

source: །ངས་འདིར་སྲེད་པའི་སྲིད་རྒྱུ་དང་། །མ་རིག་བྱ་མིན་བྱེད་པ་དེ།
en: “Here the ignorance that drives the thirst for existence And induces inappropriate actions—

source: །བག་ཉལ་བཅས་རྩ་དྲ་བ་རྣམས།
en: A network of roots including latent formations—

source: །ཡེ་ཤེས་གསལ་བའི་མེ་ཡིས་བསྲེགས།
en: Was burned up by the intense fire of wisdom.

source: །ངས་འདིར་ང་དང་ང་ཡི་དང་། །ཉེས་ཞགས་རིང་འགྲོ་རྩ་ཟུག་པ། །སྒྲིབ་པའི་མདུད་པ་དམ་པོ་དེ། །
en: “Here the belief in ‘I’ and ‘mine’ And its tangle of faults, With roots that extend far, knotted tight with obscurations,

source: ཡེ་ཤེས་མཚོན་གྱིས་བཅད་པར་གྱུར།
en: Has been severed by the blade of wisdom.

source: །ངས་འདིར་རིང་ནས་ངའི་ལྡན་པ།
en: “Here those enduring deceptions of mine

source: །སླུ་བ་ཐ་མ་རྣམ་འཇིག་པ།
en: Have at long last ended in destruction.

source: །ལེན་པར་བཅས་པའི་ཕུང་པོ་དེ།
en: The aggregates, along with the clinging to them,

source: །ཡེ་ཤེས་ཀྱིས་ནི་ཡོངས་སུ་ཤེས།
en: I have discerned through my wisdom.

source: །གཉིས་སུ་རྨོངས་པ་ལོག་འཛིན་པ།
en: “The dualistic delusions, erroneous fixations,

source: །ཐ་མར་དམྱལ་འགྱུར་དེ་དག་རྣམས།
en: Which eventually land one in hell,

source: །ངས་འདིར་མ་ལུས་བསལ་བྱས་ཏེ། །ཕྱིན་ཆད་ནམ་ཡང་སྐྱེར་མི་འགྱུར།
en: I have removed here So that they are certain never to arise again.

source: །ངས་འདིར་དགེ་བའི་རྩ་བ་ཡི། །མེ་ཡིས་སྒྲིབ་པའི་ནགས་ཚལ་བསྲེགས། །ཕྱིན་ཅི་ལོག་ནི་རྣམ་བཞི་ཡང་།
en: “Here the forest of obscurations Has been burned away by the fire of my roots of virtue.

source: །ང་ཡིས་མ་ལུས་ངེས་པར་བསྲེགས།
en: I have utterly burned up

source: །འདུ་ཤེས་སྐུད་པས་བརྒྱུས་པ་ཡི།
en: The fourfold misconception, too.

source: །རྣམ་རྟོག་ཕྲེང་བ་གནོད་བྱེད་པ། །ངས་འདིར་བྱང་ཆུབ་ཡན་ལག་གི།
en: “The harmful garland of thoughts Strung on the thread of conceptions, I have utterly reversed

source: །ཕྲེང་བ་སྣ་ཚོགས་རྣམས་ཀྱིས་བཟློག །
en: With the rosaries of the branches of awakening.

source: བགྲོད་དཀའ་དྲུག་ཅུ་རྩ་ལྔ་དང་། །གཏི་མུག་སུམ་ཅུ་དྲི་མ་ཅན།
en: “The sixty-five travails, The thirty impure delusions,

source: །སྡིག་པ་དག་ནི་བཞི་བཅུ་ངས།
en: And the forty misdeeds

source: །ས་ཡི་སྙིང་པོ་འདིར་བསལ་ཏེ། །ས་ཡི་སྙིང་པོར་འདུག་ནས་ངས།
en: I eliminated here at the center of the earth.

source: །སྡོམ་པ་མ་ཡིན་བཅུ་དྲུག་དང་། །ཁམས་ནི་རྣམ་པ་བཅྭ་བརྒྱད་དང་། །ཁྱབ་པ་ཉི་ཤུ་རྩ་ལྔ་བསལ།
en: “The sixteen uncontrolled things, The eighteen elements, And the twenty-five pains I eliminated while sitting at the center of the earth.

source: །ཉོན་མོངས་ཆུ་བོ་ཉི་ཤུ་དང་། །འགྲོ་བ་འཇིགས་པ་ཉི་ཤུ་བརྒྱད།
en: “The twenty streams of passion And the twenty-eight fears of beings

source: །བརྩོན་འགྲུས་མཐུ་དང་བརྟུལ་བ་ཡིས། །ང་འདིར་དེ་དག་ཤིན་ཏུ་འདས།
en: I utterly transcended Through the force and commitment of my perseverance.

source: །དེ་བཞིན་སངས་རྒྱས་བསྒྱིངས་སྒྲོག་པ། །ལྔ་བརྒྱ་ངས་འདིར་ཡང་དག་རྟོགས། །
en: “Likewise five hundred roars of buddhas I perfectly comprehended here.

source: བརྒྱ་ཕྲག་སྟོང་དུ་ཚང་བ་ཡི། །ཆོས་རྣམས་ང་ཡིས་ཡང་དག་རྟོགས།
en: Phenomena, one hundred thousand strong, I also perfectly comprehended.

source: །ངས་འདིར་བག་ཉལ་མ་ལུས་པ། །དགུ་བཅུ་རྩ་བརྒྱད་རྩར་བཅས་མཐའ། །ཀུན་ནས་ལྡང་བའི་ལོ་མ་རྣམས། །ཡེ་ཤེས་མེ་ཡིས་ངེས་པར་བསྲེགས།
en: “Here all the ninety-eight latent formations, Down to the bottom of their roots And all their sprouting shoots, Were burned up by the fire of my wisdom.

source: །དོགས་དང་ཡིད་གཉིས་ཀུན་འབྱུང་བ།
en: “The reservoir of doubt and uncertainty,

source: །ལྟ་བའི་ཆུ་ཡིས་གང་གྱུར་པ།
en: Filled with the waters of views

source: །མི་དགེ་ངོགས་ཅན་སྲེད་པའི་ཀླུང་།
en: From the river of craving—the fount of nonvirtue—

source: །ཤུགས་དྲག་ཡེ་ཤེས་ཉི་མས་བསྐམས།
en: Is dried up by the sun of my wisdom.

source: །ཚུལ་འཆོས་པ་དང་ཁ་གསག་སྤངས། །སྒྱུ་དང་སེར་སྣ་ཕྲག་དོག་སྡང་། །ཉོན་མོངས་དགོན་པ་དིང་འདིར་བཅད།
en: “When I rid myself of pretense and guile, Here I cut down the forest of afflictions That is teeming with deception, stinginess, hatred, and jealousy,

source: །འདུལ་བའི་མེ་ཡིས་རབ་ཏུ་བསྲེགས།
en: And burned it up with the fire of my discipline.

source: །འདིར་ནི་རྩོད་པའི་རྩ་བ་དེ། །ངན་འགྲོ་ཉམ་ངར་འདྲེན་བྱེད་པ། །འཕགས་ལ་སྐུར་པ་འདེབས་པའི་ཚིག །ཡེ་ཤེས་མཆོག་གི་སྨན་གྱིས་བསྐྱུགས།
en: “Here, through the medicine of wisdom most sublime, I purged myself of the root of conflict That induces the nausea of the lower realms—Namely, disparaging remarks made toward noble ones.

source: །ངས་འདིར་ཡེ་ཤེས་ཡོན་ཏན་དང་། །ཏིང་འཛིན་ཐོབ་ནས་ངུ་བ་དང་། ། ཆོ་ངེ་འདོན་དང་མྱ་ངན་དང་། །སྨྲེ་བ་མ་ལུས་མཐའ་མར་ཕྱིན། །
en: “Here I reached the end of all crying, Wailing, anguish, and lamentation, Once I attained The absorption and qualities born of wisdom.
